tests/results/comprehensive_stress_test_results/sustained_load.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 17361 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sfdaas/api/propagate?t0=2010-05-28T12:00:00.000%2B00:00&tf=2010-05-29T12:00:00.000%2B00:00&r0=%5B3198022.67,2901879.73,5142928.95%5D&v0=%5B-6129.640631,4489.647187,1284.511245%5D
Document Length:        3578 bytes

Concurrency Level:      50
Time taken for tests:   60.002 seconds
Complete requests:      17361
Failed requests:        17217
   (Connect: 0, Receive: 0, Length: 17217, Exceptions: 0)
Total transferred:      63725852 bytes
HTML transferred:       62198084 bytes
Requests per second:    289.34 [#/sec] (mean)
Time per request:       172.807 [ms] (mean)
Time per request:       3.456 [ms] (mean, across all concurrent requests)
Transfer rate:          1037.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      24
Processing:     3  172 104.8    150     590
Waiting:        2  172 104.8    150     590
Total:          3  172 104.8    150     590

Percentage of the requests served within a certain time (ms)
  50%    150
  66%    197
  75%    229
  80%    253
  90%    324
  95%    380
  98%    447
  99%    479
 100%    590 (longest request)